In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
monte = pd.Series(['Graham Chapman', 'John Cleese', 'Terry Gilliam',
'Eric Idle', 'Terry Jones', 'Michael Palin'])

In [3]:
monte

0    Graham Chapman
1       John Cleese
2     Terry Gilliam
3         Eric Idle
4       Terry Jones
5     Michael Palin
dtype: object

In [4]:
monte.str.lower()#要先将monte转化为字符串，再使用字符串的函数

0    graham chapman
1       john cleese
2     terry gilliam
3         eric idle
4       terry jones
5     michael palin
dtype: object

In [5]:
monte.str.len()

0    14
1    11
2    13
3     9
4    11
5    13
dtype: int64

In [6]:
monte.str.startswith('T')

0    False
1    False
2     True
3    False
4     True
5    False
dtype: bool

In [7]:
monte.str.split(' ')

0    [Graham, Chapman]
1       [John, Cleese]
2     [Terry, Gilliam]
3         [Eric, Idle]
4       [Terry, Jones]
5     [Michael, Palin]
dtype: object

In [8]:
df = pd.DataFrame({'key': ['a', 'b', 'c'] * 4,
    'value': np.arange(12.)})
df

   key  value
0    a    0.0
1    b    1.0
2    c    2.0
3    a    3.0
4    b    4.0
5    c    5.0
6    a    6.0
7    b    7.0
8    c    8.0
9    a    9.0
10   b   10.0
11   c   11.0

In [18]:
g=df.groupby('key').value

In [19]:
g.value_counts()

key  value
a    0.0      1
     3.0      1
     6.0      1
     9.0      1
b    1.0      1
     4.0      1
     7.0      1
     10.0     1
c    2.0      1
     5.0      1
     8.0      1
     11.0     1
Name: value, dtype: int64

In [14]:
g.mean()

key
a    4.5
b    5.5
c    6.5
Name: value, dtype: float64

In [15]:
g.transform(lambda x:x.mean())

0     4.5
1     5.5
2     6.5
3     4.5
4     5.5
5     6.5
6     4.5
7     5.5
8     6.5
9     4.5
10    5.5
11    6.5
Name: value, dtype: float64

In [21]:
#透视表
import seaborn as sns

In [23]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [25]:
titanic.groupby("sex")['survived'].mean()#统计男性与女性生还率

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [29]:
titanic.groupby(['sex','pclass'])['survived'].aggregate('mean').unstack()

pclass         1         2         3
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [30]:
titanic.pivot_table('survived',index='pclass',columns='sex')

sex       female      male
pclass
1       0.968085  0.368852
2       0.921053  0.157407
3       0.500000  0.135447

In [31]:
titanic.pivot_table('survived',index='sex',columns='pclass')

pclass         1         2         3
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [34]:
#分组问题，值得借鉴！
#将年龄作为第三个维度
age = pd.cut(titanic['age'], [0, 18, 80])
titanic.pivot_table('survived',index=['sex',age],columns='pclass')

pclass                  1         2         3
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663